USER_FIRST_NAMES = {
    'male': ['Сергей', 'Иван', 'Павел', 'Олег', 'Николай', 'Артур', 'Максим', 'Антон', 'Александр', 'Михаил', 'Степан', 'Григорий', 'Даниил', 'Игорь', 'Андрей', 'Дмитрий'],
    'female': ['Анна', 'Ольга', 'Виктория', 'Мария', 'Марина', 'Наталья', 'Екатерина', 'Анастасия', 'Алиса', 'Вероника', 'Любовь', 'Зина', 'Людмила']
}

USER_LAST_NAMES = {
    'male': ['Сафронов', 'Гришин', 'Голиков', 'Сухорученко', 'Волков', 'Ярлыков', 'Жилкин', 'Черников', 'Кокшаров', 'Гетьман', 'Попов', 'Кривцов', 'Фадеев', 'Мельник', 'Горяинов', 'Коледин', 'Иванников', 'Иванов', 'Пономарчук', 'Быковский', 'Старков'],
    'female': ['Алиева', 'Архипова', 'Бирюкова', 'Глаголева', 'Галактионова', 'Егорова', 'Гусева', 'Щербак', 'Становова', 'Кочнева', 'Воробьева', 'Ястребинская', 'Фролова', 'Самойленко', 'Лазутова', 'Анисимова', 'Костарева']
}

USER_MIDDLE_NAMES = {
    'male': ['Сергеевич', 'Иванович', 'Павлович', 'Олегович', 'Николаевич', 'Артурович', 'Максимович', 'Антонович', 'Александрович', 'Михайлович', 'Степанович', 'Григорьевич', 'Даниилович', 'Игоревич', 'Андреевич', 'Дмитриевич'],
    'female': ['Сергеевна', 'Ивановна', 'Павловна', 'Олеговна', 'Николаевна', 'Артуровна', 'Максимовна', 'Антоновна', 'Александровна', 'Михайловна', 'Степановна', 'Григорьевна', 'Данииловна', 'Игоревна', 'Андревна', 'Дмитриевна'],
}

COMPANY_NAMES = ['Яндекс', 'Сбер', 'Okko', 'Yandex Cloud', 'VK', 'S7 airlines', 'Альфа-Банк', 'Yandex.Go', 'AvitoTech', 'Ozon', 'МТС']

COMPANY_ROLES = ['CTO', 'Директор по продуктовой разработке', 'Руководитель направления', 'СРО', 'CIO', 'Руководитель управления ИТ инфраструктуры и сопровождения сервисов', 'Руководитель направления разработки и внедрения enterprise проектов']

CITIES = ['Сочи', 'Таганрог', 'Москва', 'Казань', 'Рязань', 'Уфа', 'Новосибирск', 'Ижевск', 'Санкт-Петербург', 'Нижний Новгород', 'Ростов-на-Дону', 'Краснодар', 'Самара', 'Екатеринбург']

PNONE_TEMPLATE = 79571000000 # Код 957 не используется